# coding:utf-8
def extract():
    text = '''母亲/n:593 人/n:227 道/n:210 头/n:172 声音/n:167 句/n:154 钟/n:152 妻/n:152 脸/n:140 树/n:135 妈/n:134 声/n:131 事/n:127 眼睛/n:122 话/n:116 眼光/n:108 时候/n:105 主任/n:103 手/n:102 带/n:100 心/n:93 女人/n:93 点/n:90 钱/n:87
母亲/n:78 字/n:76 太太/n:76 地方/n:76 事情/n:75 屋子/n:70 低声/n:68 身体/n:68 身子/n:66 一口气/n:65 公司/n:65 东西/n:64 同事/n:62 办法/n:61 生活/n:56 大声/n:55 信/n:54 先生/n:52 件/n:50 衣服/n:47 妻子/n:44 表情/n:44 方/n:43 孩子/n:43 脸色/n:42 杯/n:41 儿子/n:41 脑子/n:39 门/n:38 嘴/n:38 饭/n:36 问题/n:36 眼泪/n:35 家/n:35 科长/n:35 意思/n:35 方桌/n:35 医生/n:34 笑容/n:33 碗/n:33 银行/n:33 工作/n:32 校样/n:31 步/n:31 同学/n:30 思想/n:30 大家/n:30 房门/n:29 长/n:29 药/n:29 样子/n:29 信笺/n:29 梦/n:28 时间/n:28
妻/n:27 小声/n:27 痰/n:27 书桌/n:26 情形/n:26 消息/n:25 早点/n:25 笔/n:25 根/n:24 精神/n:23 脚/n:23 一句话/n:23 藤椅/n:23 间/n:23 最后/n:23 光/n:22 开水/n:22 杯子/n:22 日本人/n:22 医院/n:22 电灯/n:21 喉咙/n:21 '''
    total = text.split(" ")
    for i in total:
        list = i.split("/")[0]

        print list.decode('utf-8')


extract()
